{
    "basic_info": {
      "description_header": "Hola",
      "description": "👋 Soy Dilsher Singh. Soy un estudiante con especialización en Ingeniería Mecánica y con especialización en materiales y procesamiento de Electrónica. Completaré mi BS / Ingeniería Mecánica con énfasis en Diseño y Pruebas y especialización en Materiales y Procesamiento de Electrónica en junio de 2022. Completé varios proyectos de ingeniería mecánica a lo largo de mis cursos y el otoño y la primavera pasados, hice proyectos llamados energía de vivienda limpia y jabalí solar, donde diseñé prototipos, realicé pruebas y preparé informes resumidos del proyecto. Creo que su empresa produce excelentes productos y estoy muy interesado en asumir un puesto en su empresa.",
      "section_name": {
        "about": "acerca de",
        "projects": "proyecto",
        "skills": "habilidades",
        "experience": "experiencia"
      }
    },
    "projects": [
      {
        "title": "Bus 286",
        "startDate": "2023",
        "description": "A 5,000 sq feet inclusive playground for kids aged 5 to 12. This will be a sensory-friendly play area that complies with ADA standards. Play equipment includes slides, swings, climbers, a bridge, and a tunnel. This project will be completed in 5 months, and a building will be erected at St. James Park in San Jose, California. The playground will be accessible to the general public in the city's central business district, and the project will be completed with a budget of $150,000.00.",
        "images": [
          "images/portfolio/doc/bus286.png"
        ],
        "url": "https://www.docdroid.net/7AlzqNm/bus-286-pdf",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Ise-140",
        "startDate": "2023",
        "description": "After analyzing and comparing multiple methods for forecasting, planning, MRP, Capacity, and simulation/scheduling, we identified a few notable findings. Preferred forecasting models are reported to Vikings division so that in the future, the same methods can be used to forecast demand since the MAD of all methods used are <10 which abides by the standards. Forecasting models suggested are exponential smoothing with trend adjustment for products 1, 4, and 5, seasonal forecast without trend for product-2 and seasonal forecast with trend for product-3. Vikings division should adopt formal production planning policies that reduce overall cost, inventory and backorders. Based on our analysis, we recommend that level policy be used for products 2,3 and 4, and chase policy for products 1 and 5. MRP allows for gathering information regarding the amount of material needed to perform the operations of the company which helps specify amounts of stock needed to meet the parameters stated. Capacity planning analysis gives an overall idea of the amount of stations and subproducts that is possible to manufacture along with providing values of how long the setup and processing time regarding each station will require which gives an overall layout of the products that can be produced. Lastly, the simulation/scheduling helped resolve the layout of how the allocation of the capacity will be handled as it provides information of how queue times are handled along with how the subproducts and going through the stations and which can provide variables of factors such as repair and downtime needed to sustain the workplace",
        "images": [
          "images/portfolio/doc/ios140.png"
        ],
        "url": "https://www.docdroid.net/A3QhEfR/ise-140-operations-planning-and-control-pdf",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Ise-201",
        "startDate": "2023",
        "description": "The dataset selected for the project is california housing dataset. The purpose of this project is to predict price of houses in California based on a number of location-based predictors. The motivation behind selecting this dataset is to understand how the prices of houses move and what factor contribute to high or low price for houses. In today’s technologically advanced world, there are many ways in which real estate agents and policy makers can benefit from this housing price analysis. If I were a real estate agent, Predictive analysis of housing prices would help me conduct business in less time with more accuracy(Machin, 2019). Alternatively, policy makers and economists can understand the trend in housing prices and it’ll help them in the decision making process.",
        "images": [
          "images/portfolio/doc/ios-201.png"
        ],
        "url": "https://www.docdroid.net/o4TLD2o/ise-201-pdf",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "106 Project",
        "startDate": "2021",
        "description": "Automated Blinds",
        "images": [
          "images/portfolio/animal-shelter/auto.jpg"
        ],
        "url": "https://www.youtube.com/watch?v=l62_CO2rL6I",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "IR Tachometer",
        "startDate": "2021",
        "description": "IR Tachometer",
        "images": [
          "images/portfolio/photography/ir.jpg"
        ],
        "url": "https://www.youtube.com/watch?v=iplj1uvPVe4",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Intel",
        "title": "Technical Intern",
        "years": "11.20 - 04.21",
        "mainTech": [
          "Engineer 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Creative Security Company",
        "title": "Supervisor",
        "years": "01.2015 - Present",
        "mainTech": [
          "Security 1/15"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }