{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I'm Dilsher singh. I am a student majoring in Mechanical Engineering with specialization in Mechatronics. I will completeing my BS/Mechanical engineering with an emphasis on Design and Testing in Spring 2022. I have completed several mechanical engineering projects throughout my courses and last fall and spring, I did projects named clean housing energy and solar boar, where I designed prototypes, conducted testing, and prepared summary reports on the project. I think your company produces great products and I'm very interested in assuming a postion at your company",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Bus 286",
        "startDate": "2023",
        "description": "A 5,000 sq feet inclusive playground for kids aged 5 to 12. This will be a sensory-friendly play area that complies with ADA standards. Play equipment includes slides, swings, climbers, a bridge, and a tunnel. This project will be completed in 5 months, and a building will be erected at St. James Park in San Jose, California. The playground will be accessible to the general public in the city's central business district, and the project will be completed with a budget of $150,000.00.",
        "images": [
          "images/portfolio/doc/bus286.png"
        ],
        "url": "https://www.docdroid.net/7AlzqNm/bus-286-pdf",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Ise-140",
        "startDate": "2023",
        "description": "After analyzing and comparing multiple methods for forecasting, planning, MRP, Capacity, and simulation/scheduling, we identified a few notable findings. Preferred forecasting models are reported to Vikings division so that in the future, the same methods can be used to forecast demand since the MAD of all methods used are <10 which abides by the standards. Forecasting models suggested are exponential smoothing with trend adjustment for products 1, 4, and 5, seasonal forecast without trend for product-2 and seasonal forecast with trend for product-3. Vikings division should adopt formal production planning policies that reduce overall cost, inventory and backorders. Based on our analysis, we recommend that level policy be used for products 2,3 and 4, and chase policy for products 1 and 5. MRP allows for gathering information regarding the amount of material needed to perform the operations of the company which helps specify amounts of stock needed to meet the parameters stated. Capacity planning analysis gives an overall idea of the amount of stations and subproducts that is possible to manufacture along with providing values of how long the setup and processing time regarding each station will require which gives an overall layout of the products that can be produced. Lastly, the simulation/scheduling helped resolve the layout of how the allocation of the capacity will be handled as it provides information of how queue times are handled along with how the subproducts and going through the stations and which can provide variables of factors such as repair and downtime needed to sustain the workplace",
        "images": [
          "images/portfolio/doc/iso140.png"
        ],
        "url": "https://www.docdroid.net/A3QhEfR/ise-140-operations-planning-and-control-pdf",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Ise-201",
        "startDate": "2023",
        "description": "The dataset selected for the project is california housing dataset. The purpose of this project is to predict price of houses in California based on a number of location-based predictors. The motivation behind selecting this dataset is to understand how the prices of houses move and what factor contribute to high or low price for houses. In today’s technologically advanced world, there are many ways in which real estate agents and policy makers can benefit from this housing price analysis. If I were a real estate agent, Predictive analysis of housing prices would help me conduct business in less time with more accuracy(Machin, 2019). Alternatively, policy makers and economists can understand the trend in housing prices and it’ll help them in the decision making process.",
        "images": [
          "images/portfolio/doc/ios-201.png"
        ],
        "url": "https://www.docdroid.net/o4TLD2o/ise-201-pdf",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "106 Project",
        "startDate": "2021",
        "description": "Automated Blinds",
        "images": [
          "images/portfolio/animal-shelter/auto.jpg"
        ],
        "url": "https://www.youtube.com/watch?v=l62_CO2rL6I",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "106 Project",
        "startDate": "2021",
        "description": "This project is solving the problem of wasted energy within buildings and homes, because currently the lights turned on inside buildings do not utilize natural, ambient light from the sun. Rather than having unnecessary light from a light source, the automated light sensing smart blinds can sense the amount of light outside the window and in the room, and then adjust the angle of the blinds to save energy by utilizing the available outdoor light. This way, the light source will not be running at maximum power output while there is excess light coming through the window. This project aims to design and construct the light sensing blinds to achieve the aforementioned goals. Hardware test results from this project demonstrate the capabilities of the smart blind system to measure ambient light outside the window, to adjust the angle of each of the blinds on the window, and to change the desired brightness of the room. ",
        "images": [
          "images/portfolio/animal-shelter/auto.jpg"
        ],
        "url": "https://www.youtube.com/watch?v=l62_CO2rL6I",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "IR Tachometer",
        "startDate": "2021",
        "description": "The functionality and sensitivity of an IR sensor were explored in this experiment. The use of datasheets and circuit design were utilized and improved in the process of designing a personalized tachometer. A deeper understanding in the application of DAQ and LabVIEW software was acquired. One lesson learned was the difference in ability between my DAQ and BNC2120 DAQ. It was discovered that my DAQ does not have a counter, and therefore required more advanced LabVIEW programming to output a rotational speed reading. The BNC2120 DAQ counter function was explored in this experiment and made the frequency to rotational speed conversion relatively simple. Another lesson learned was to continually measure the interrupters voltage signal output with a DMM to ensure the collector and emitter was not damaged with the variation of voltage. It is highly recommended to reference the datasheet for your specific IR sensor and an addition of pulldown resistors to each node except the ground when wiring the interrupter. It is common to burn out the emitter diodes, even with voltages within the datasheet specifications. Due to this possibility, consistently checking that the IR sensor is functioning properly using a DMM can save a lot of time. Secondly, to improve the accuracy of frequency readings, it is recommended to provide a shield around the IR sensor to reduce ambient light noise. The more consistency introduced into the experiment, the higher the likelihood of accurate results.",
        "images": [
          "images/portfolio/photography/ir.jpg"
        ],
        "url": "https://www.youtube.com/watch?v=iplj1uvPVe4",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Save The Car",
        "startDate": "2018",
        "description": "This poster describes the design and implementation of a senior project involving a Solar Panel Shed for the parking lot. During the summer times the cars parked outside, the interior temperature can become very high causing discomfort for the driver and passengers. Therefore a device is needed to keep the vehicle interior at comfortable temperatures while standing in the parking lot.",
        "images": [
          "images/portfolio/photography/poster.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Trash compactor",
        "startDate": "2021",
        "description": "We designed a household trash can compactor to help reduce the amount of plastic bags being used. The trash can compressor will be made out of stainless steel equipped With two safety sensors and  two solenoids in both doors to make sure they stay locked as the compactor moves. The mechanism will be powered by a wall outlet. The compressor  is run by a power screw that runs at ⅓ hp and it will unfold 21 in , making the arms come down in 10 seconds and 10 seconds to come back up.  The power screw is designed to fold back up when it  feels a pressure of 2300 lbs So the links won't bend.",
        "images": [
          "images/portfolio/photography/dust.png"
        ],
        "url": "",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Guess Game",
        "startDate": "2017",
        "description": "Play game is an interactive program, which will ask the user to guess letters in order to find the word. The word has missing letters and can only be completed with the right letter. The game only gives three attempts to win. The words are input in a dictionary provided in the code. The script contains a randrange function to get a random word, and also a while loop, which make the program run till the user guess is right, or run out of attempts.",
        "images": [
          "images/portfolio/photography/guessgame.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "Wall Plaster Machine",
        "startDate": "2015",
        "description": "The machine is a residential building, office building wall plastering special equipment. Wipable walls are: cement walls, brick walls, hollow walls, light brick walls, brick walls and so on. Applicable ash is: white sand gray, stone powder, cement ash, foam mortar, dry powder mortar, gypsum and so on. Plaster thickness of 3cm below the plaster height of 5m can be used below.",
        "images": [
          "images/portfolio/photography/yellow.jpeg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "MinSeg Robot Balancing",
        "startDate": "2021",
        "description": "Self balancing robot made by using MATLAB and arduino",
        "images": [
          "images/portfolio/photography/minseg.jpg"
        ],
        "url": "https://www.youtube.com/shorts/kH0u-yroqcg",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      },
      {
        "title": "APPARATUS TO FEED EMPTY SANDBAGS INTO AN EXISTING SANDBAG FILLING MACHINE.",
        "startDate": "2022",
        "description": "APPARATUS TO FEED EMPTY SANDBAGS INTO AN EXISTING SANDBAG FILLING MACHINE.",
        "images": [
          "images/portfolio/photography/pro.jpg"
        ],
        "url": "https://www.youtube.com/watch?v=dmQhNwxMjqg",
        "technologies": [
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          },
          {
            "class": "",
            "name": ""
          }
        ]
      }
    ],
    
    "experience": [
      {
        "company": "San Jose State University",
        "title": "Teaching Assistant",
        "years": "August 2021 - Dec 2022",
        "mainTech": [
          "Engineer 1/1/22"
        ],
        "technologies": [
          "Nodes",
          "Clusters",
          "Python",
          "ISMP",
          "Mechanical",
          "EF Core",
          ".NET Core",
          "Troubleshooting",
          "Datacenter"
        ]
      },
      {
        "company": "Intel",
        "title": "Undergrad Data Center Technician Intern",
        "years": "June 2022 - October 2022",
        "mainTech": [
          "Engineer June 2022 - October 2022"
        ],
        "technologies": [
          "Nodes",
          "Clusters",
          "Python",
          "ISMP",
          "Mechanical",
          "EF Core",
          ".NET Core",
          "Troubleshooting",
          "Datacenter"
        ]
      },
      {
        "company": "Creative Security Company",
        "title": "Supervisor",
        "years": "08.2017 - Present",
        "mainTech": [
          "Security 08.2017 - Present"
        ],
        "technologies": [
          "Supervisor",
          "Security",
          "Team",
          "Performence",
          "Reports"
        ]
      },
      {
        "company": "Rail Coach Factory",
        "title": "Mechanical Intern",
        "years": "06.2014 - 07.2014",
        "mainTech": [
          "Intern 06.2014 - 07.2014"
        ],
        "technologies": [
          "Duties",
          "Prints",
          "Performence",
          "Process Center"
        ]
      },
      {
        "company": "CIHT",
        "title": "2D/3D Drafting",
        "years": "02.2013 - 03.2013",
        "mainTech": [
          "Intern 02.2013 - 03.2013"
        ],
        "technologies": [
          "Supervisor",
          "Duties",
          "Prints",
          "Performence",
          "Process Center"
        ]
      }
    ]
  }